vbirjuko/EFM32_ROMI_Robot/Maze.c
      for (current_index = 0; current_index < max_map_cell; current_index++) { // ищем похожие координаты
          // И проверяем, были ли мы уже здесь?
          if ((ABS(my_coordinate.east - map[current_index].coordinate.east) < data.tolerance) &&
              (ABS(my_coordinate.north - map[current_index].coordinate.north) < data.tolerance)) {
              // я тут был.
              my_coordinate.east = map[current_index].coordinate.east;
              my_coordinate.north = map[current_index].coordinate.north;
              break; // current_index указывает на ячейку карты.
          }  // нет, мы тут еще не были
      }

      if (data.pathlength == 0) {
          if (current_index == max_map_cell && expect_index == UNKNOWN) {  // новая ячейка
              map[current_index].coordinate.east = my_coordinate.east;
              map[current_index].coordinate.north = my_coordinate.north;
              map[current_index].node_link [(move_direction + back) & TURN_MASK] = last_index;
              map[current_index].node_link [(move_direction+straight) & TURN_MASK] = UNKNOWN;
              map[current_index].node_link [(move_direction + left)  & TURN_MASK] = UNKNOWN;
              map[current_index].node_link [(move_direction + right) & TURN_MASK] = UNKNOWN;

              map[current_index].pass_count[(move_direction + back) & TURN_MASK] = 1;
              map[current_index].pass_count[(move_direction+straight) & TURN_MASK]	=	(available & STRAIGHT_MASK) ? 0 : 4;
              map[current_index].pass_count[(move_direction + left) & TURN_MASK] = 	(available & LEFT_MASK)     ? 0 : 4;
              map[current_index].pass_count[(move_direction + right)& TURN_MASK] = 	(available & RIGHT_MASK)    ? 0 : 4;

              if (++max_map_cell > MAX_MAP_SIZE) {
                  drop_command_queue();
                  squareXY(0,0, 127, 63, 1);
                  update_display();
                  putstr(0, 3, " OUT OF MEMORY  ", 1);
                  max_map_cell = MAX_MAP_SIZE;
              }
          } else { // старая ячейка
              if ((expect_index != UNKNOWN) && (expect_index != current_index)) {
                  if ((expect_index != UNKNOWN) && data.ignore_coordinate_error) {
                      current_index = expect_index;
                      my_coordinate.north = map[expect_index].coordinate.north;
                      my_coordinate.east  = map[expect_index].coordinate.east;
                  } else {
                      char number_str[16];
                      unsigned int strlen;
                      drop_command_queue();
                      squareXY(0,0, 127, 63, 1);
                      update_display();
                      putstr(0, 2, "I AM LOST AGAIN", 1);
                      putstr(0, 3, "Expect ", 1);
                      num2str(expect_index, number_str);
                      putstr(8, 3, number_str, 1);
                      strlen = num2str(map[expect_index].coordinate.east, number_str);
                      putstr(0, 4, number_str, 1);
                      putstr(strlen, 4, ",", 1);
                      num2str(map[expect_index].coordinate.north, number_str);
                      putstr(strlen+1, 4, number_str, 1);
                      putstr(0, 5, "Current ", 1);
                      num2str(current_index, number_str);
                      putstr(8, 5, number_str, 1);
                      strlen = num2str(my_coordinate.east, number_str);
                      putstr(0, 6, number_str, 1);
                      putstr(strlen, 6, ",", 1);
                      num2str(my_coordinate.north, number_str);
                      putstr(strlen+1, 6, number_str, 1);
                      data_log_finish();
                      return 1;
                  }
              }
              if (skippasscount == 0) {
                  if (map[current_index].pass_count[(move_direction + back) & TURN_MASK] < 2) {
                      map[current_index].pass_count[(move_direction + back) & TURN_MASK] += 1;
                  }
              } else skippasscount = 0;
              map[current_index].node_link [(move_direction + back) & TURN_MASK] = last_index;
          }
          if (!available) {
              while (profiler_queue_empty == 0) continue;
              switch (check_color()) {
                case red:
                  data.red_cell_nr = current_index;
                  found_red = 1;
                  LaunchPad_Output(RED);
                  break;

                case green:
                  data.green_cell_nr = current_index;
//                  put_command(command_wait | 2 * FRAMESCANPERSECOND);
                  LaunchPad_Output(GREEN);
                  break;

                case white:
                  LaunchPad_Output(RED|GREEN|BLUE);
                  break;
                case yellow:
                  LaunchPad_Output(RED|GREEN);
                  break;
                default:
                  LaunchPad_Output(0);
                  break;
              }
          }

          count_green = 0; count_yellow = 0; count_red = 0;
          for (ii = 0; ii < 4; ii++) {
              switch (map[current_index].pass_count[ii]) {
                case 0:	count_green++; 	break;
                case 1: count_yellow++; break;
                case 2: count_red++;	break;
              }
          }
          if (count_yellow == 3) skiplevel = 0; // есть одиночная нить пересекающая узел - возвращаемся
          else if (count_green)  skiplevel = 1;  // оставить только зелёные проходы
          else if (count_yellow) skiplevel = 2;  // оставить все не красные проходы
          else {
              put_command(command_finish | 100);
              put_command(command_wait | 2 * FRAMESCANPERSECOND);
              goto finish;   // если нет ни зелёного, ни желтого прохода - больше идти некуда.
          }
          // ********************************
          //   Попробуем так. Будем использовать данные от первоначального анализа узла.
          available = LEFT_MASK | RIGHT_MASK | STRAIGHT_MASK;
          // ********************************
          if (map[current_index].pass_count[(move_direction+left) & TURN_MASK] >= skiplevel) available &= ~LEFT_MASK;
          if (map[current_index].pass_count[(move_direction+right) & TURN_MASK] >= skiplevel) available &= ~RIGHT_MASK;
          if (map[current_index].pass_count[(move_direction+straight) & TURN_MASK] >= skiplevel) available &= ~STRAIGHT_MASK;
          map[last_index].node_link[move_direction & TURN_MASK] = current_index;

