vbirjuko/EFM32_ROMI_Robot/Maze.c
          turn_index = ((unsigned int)data.lefthand < 6u) ? data.lefthand : Rand() % 6;
          turn_direction = SelectTurn(available, turn_sequence[turn_index]);
      } // if data.pathlength == 0

      if (data.runnumber == 0) {
          show_number(current_index, 0);
          if (available & LEFT_MASK)      show_arrow(40, 6, left);
          if (available & STRAIGHT_MASK)  show_arrow(56, 6, straight);
          if (available & RIGHT_MASK)     show_arrow(72, 6, right);
          switch (turn_direction) {
            case left:      show_arrow(40, 4, left);    break;
            case straight:  show_arrow(56, 4, straight);  break;
            case right:     show_arrow(72, 4, right);     break;
            case back:      show_arrow(56, 4, back);    break;
          }
      }

      // *************************************************************************************************
      // Если возвращаемся, то сначала делаем это виртуально

      bearing_dir_t back_bearing = move_direction;

      if (1 && (skiplevel != 1)) {
          unsigned int virtual_index = current_index;

          do {
              back_bearing += turn_direction;
              back_bearing &= TURN_MASK;

              if (map[virtual_index].pass_count[back_bearing] < 2) {
                  map[virtual_index].pass_count[back_bearing] += 1;
              } else LaunchPad_Output(RED); // Ошибка!!! Выбран красный коридор!

              virtual_index = map[virtual_index].node_link[back_bearing];
              if (map[virtual_index].pass_count[(back_bearing+back) & TURN_MASK] < 2) {
                  map[virtual_index].pass_count[(back_bearing+back) & TURN_MASK] += 1;
              }

              count_green = 0; count_yellow = 0; count_red = 0;
              for (ii = 0; ii < 4; ii++) {
                  switch (map[virtual_index].pass_count[ii]) {
                    case 0: count_green++;  break;
                    case 1: count_yellow++; break;
                    case 2: count_red++;  break;
                  }
              }
              if (count_yellow == 3) skiplevel = 0; // есть одиночная нить пересекающая узел - возвращаемся
              else if (count_green)  skiplevel = 1;  // оставить только зелёные проходы
              else if (count_yellow) skiplevel = 2;  // оставить все не красные проходы
              else skiplevel = 3;

              available = LEFT_MASK | RIGHT_MASK | STRAIGHT_MASK;
              if (map[virtual_index].pass_count[(back_bearing+left) & TURN_MASK] >= skiplevel) available &= ~LEFT_MASK;
              if (map[virtual_index].pass_count[(back_bearing+right) & TURN_MASK] >= skiplevel) available &= ~RIGHT_MASK;
              if (map[virtual_index].pass_count[(back_bearing+straight) & TURN_MASK] >= skiplevel) available &= ~STRAIGHT_MASK;

              turn_index = ((unsigned int)data.lefthand < 6u) ? data.lefthand : data.lefthand % 6;//Rand() % 6;
              turn_direction = SelectTurn(available, turn_sequence[turn_index]);

          } while (skiplevel == 2);
          // Теперь надо реально переместиться
          search_way_simple(current_index, virtual_index, move_direction);
          // left=3      +=      south=2         east=1   => 0
          turn_direction += (back_bearing - move_direction);
          turn_direction &= TURN_MASK;
          skiplevel = 1;
          pathsequence = 0;
          play = 1;
          // *
          // *************************************************************************************************
      }

      if (data.pathlength) {
//          LaunchPad_Output(BLUE);
          if (--play == 0) {
              while (((length[pathsequence] & COMMAND_MASK) == command_turn) && (pathsequence < data.pathlength)) {
                  while (put_command(length[pathsequence]));
                  turn_direction =  length[pathsequence]; // для отображения на дисплее
                  move_direction += length[pathsequence];
                  move_direction &= TURN_MASK;

                  // Заезд на красное поле, пауза и возвращение в лабиринт.
                  if ((pathsequence == 0) && (found_red) && ((int)current_index == data.red_cell_nr)) {
                      put_command(command_back | 100);
                      put_command(command_wait | 2 * FRAMESCANPERSECOND);
                      if (data.cell_step) put_command(command_entrance | data.cell_step);
                      else                put_command(command_entrance | 150);
                  }
                  pathsequence++;
              }
              block_profiler(1);
              while (((length[pathsequence] & COMMAND_MASK) == command_forward) && (pathsequence < data.pathlength)) {
                  while (put_command(length[pathsequence])); // после поворота обязательна команда вперед
                  pathsequence++;
                  play++;
              }
              block_profiler(0);
              if (pathsequence >= data.pathlength) {
                  data.pathlength = 0;
                  skippasscount = 1;
              }
          }
      } else {
//          LaunchPad_Output(GREEN);
          switch (turn_direction) {
            case straight:
              break;

            case left:
            case right:
            case back:
              put_command(command_turn | turn_direction);
              break;
          }

          move_direction += turn_direction;
          move_direction &= TURN_MASK;

          if (map[current_index].pass_count[move_direction] < 2) {
              map[current_index].pass_count[move_direction] += 1;
          } else LaunchPad_Output(RED); // Ошибка!!! Выбран красный коридор!
          expect_index = map[current_index].node_link[move_direction];

          if (expect_index != UNKNOWN) { // то надо дать знать длину сегмента.
            switch (move_direction) {
              case north:
                next_segment_length = map[expect_index].coordinate.north - map[current_index].coordinate.north;
                break;
              case south:
                next_segment_length = map[current_index].coordinate.north - map[expect_index].coordinate.north;
                break;
              case east:
                next_segment_length = map[expect_index].coordinate.east - map[current_index].coordinate.east;
                break;
              case west:
                next_segment_length = map[current_index].coordinate.east - map[expect_index].coordinate.east;
                break;
            }
        } else next_segment_length = 0;
        put_command(command_forward | next_segment_length);
      }
      last_index = current_index;
  } while (1);

  finish:
  while (profiler_queue_empty == 0) continue;
  data_log_finish();
//  copy_data32_dma((uint32_t *)length, (uint32_t *)data.length, data.pathlength);
//  copy_data_dma(path, data.path, data.pathlength);
  data.map_size = max_map_cell;
  spi_write_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));
  Search_Short_Way_with_turns();
  data.crc32 = calc_crc32((uint8_t*)&data, sizeof(data)-4);
  spi_write_eeprom(EEPROM_COPY_ADDRESS, (uint8_t *)&data, sizeof(data));
  spi_write_eeprom(EEPROM_CONFIG_ADDRESS, (uint8_t *)&data, sizeof(data));
  return 0;
}
//


#include "em_common.h"

SL_WEAK void benchmark_start(void) { };
SL_WEAK unsigned int benchmark_stop(void) { return 0; };


unsigned int calculation_time;
static unsigned int path_length_table[MAX_MAP_SIZE*2];

#define QUEUE_SIZE  64
static unsigned int sort_idx[QUEUE_SIZE], sort_tail=0;

static unsigned int insert_val(unsigned int val, unsigned int idx) {
    unsigned int i;

    if (++sort_tail > (QUEUE_SIZE-1)) return 1;
    for (i = sort_tail-1; i > 0; i--) {
        if(path_length_table[sort_idx[i-1]] < val) {
            sort_idx[i] = sort_idx[i-1];
        } else break;
    }
    sort_idx[i] = idx;
    return 0;
}

static unsigned int extract_val(void) {
    if (sort_tail)return sort_idx[--sort_tail];
    else          return sort_idx[sort_tail];
}

