vbirjuko/EFM32_ROMI_Robot/Maze.c
int brakepath = 0;

int TimeToRunStraight(int distance) {  // in milliseconds from millimeters.
  if (distance < brakepath * 2) {
      return sqrt(3000000 * distance/(11 * data.acceleration));
  } else if ((distance + 2*brakepath) < 7159) {
      return 300000 * (distance + 2*brakepath)/(11 * data.maxmotor);
  } else {
      return  27273 * (distance + 2*brakepath)/data.maxmotor;
  }
}

void InitBrakePath(void) {
  // Расстояние, необходимое для торможения от максимальной скорости:
  // (220mm/100)^2 * (V^2 - v^2) / (2 * a * 400*60)
  brakepath = (data.maxmotor*data.maxmotor)/data.acceleration*11/240000;
  // turn length: 143mm wide * Pi / 4 = 112mm - each wheel run to turn 90 degree.
  data.turncost = TimeToRunStraight(112);
}

unsigned int Search_Short_Way_with_turns(void) {

  unsigned int k, min_index, destination;
  int	distance;
  int prev_bearing, bearing;

  fill_data32_dma(0xffffffff, (uint32_t*)path_length_table, data.map_size*2);
  data.pathlength = 0;

  InitBrakePath();
  spi_read_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));

  // переводим в двухслойную карту
  // однозначное соответствие: каждый узел делится на два n*2 и (n*2)+1
  // между ними сегмент длиной стоимостью поворота. К четным узлам примыкают
  // меридианальные сегменты - север/юг, к нечетным широтные - запад/восток.
  // каждый из этих сегментов удлинняется на стоимость прямого прохода узла.

  benchmark_start();
  while (dma_flag) continue; // ждём окончания fill_dma path_length[] <= 0xFFFFFFFF
  // Начинаем поиск с конца - стартовая точка финиш.
  // Причем, прибытие с любой стороны допустимо.
  path_length_table[data.red_cell_nr * 2] = 0;
  path_length_table[data.red_cell_nr * 2 + 1] = 0;

  sort_tail = 0;
  if (insert_val(0, data.red_cell_nr * 2)) return 1;
  if (insert_val(0, data.red_cell_nr * 2 + 1)) return 1;

  // Составляем карту высот по алгоритму Дейкстры
  while (sort_tail) {
      min_index  = extract_val();
      for (k = 0; k < 2; k++) {
          unsigned int next_min_index = min_index;
          while ((destination = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]) != UNKNOWN) {
              distance =  (min_index & 0x01) ? (map[next_min_index/2].coordinate.east  - map[destination].coordinate.east) :
                                               (map[next_min_index/2].coordinate.north - map[destination].coordinate.north);
              if (distance < 0) distance = -distance;
              distance = TimeToRunStraight(distance); // переводим миллиметры в миллисекунды.
              // до этого destination был индекс в карте,
              // а теперь будет индексом в таблице расстояний
              destination = destination * 2 + (next_min_index & 0x01);
              if (path_length_table[destination] > (path_length_table[next_min_index] + distance)) {
                  path_length_table[destination] = path_length_table[next_min_index] + distance;
                  if (insert_val(path_length_table[destination], destination)) return 1;
              }
              next_min_index = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]*2 + (min_index & 0x01);
          }
      }
      distance = data.turncost;
      destination = min_index ^ 0x01;
      if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
          path_length_table[destination] = path_length_table[min_index] + distance;
          if (insert_val(path_length_table[destination], destination)) return 1;
      }
  }

  // таблица расстояний составлена - надо строить маршрут.
  // Теперь скатываемся вниз для создания кратчайшего пути
  // от старта к финишу.
  data.pathlength = 0; // указатель пути на начало
  for (unsigned int ii = north; ii <= west; ii++) {
      if (map[data.green_cell_nr].node_link[ii] != UNKNOWN) {
          prev_bearing = ii;
          min_index = (data.green_cell_nr << 1) | (ii & 0x01);
          break;
      }
  }

//  prev_bearing = north;
//  min_index = (data.green_cell_nr << 1);  // начинаем с того места где находимся и куда повернуты
//    if (path_length_table[min_index] > path_length_table[min_index+1]) {
//        min_index++;
//        prev_bearing = east;
//    }
  while (path_length_table[min_index]) {
      for (k = 0; k < 3; k++) {
          if (k < 2) {
              int step = 0;
              while ((destination = map[min_index/2+step].node_link[2*k + (min_index & 0x01)]) != UNKNOWN) {
                  distance =  (min_index & 0x01) ? (map[min_index/2].coordinate.east  - map[destination].coordinate.east) :
                                                   (map[min_index/2].coordinate.north - map[destination].coordinate.north);
                  if (distance < 0) distance = -distance;
                  distance = TimeToRunStraight(distance);

                  // до этого destination был индекс в карте,
                  // а теперь будет индексом в таблице расстояний
                  destination = destination*2 + (min_index & 0x01);
                  if ((path_length_table[min_index] - distance) == (path_length_table[destination])) {
                      bearing = (bearing_dir_t)((min_index & 0x01) + 2*k);
                      if (bearing != prev_bearing) {
                          data.length[data.pathlength++] = (command_turn | ((bearing - prev_bearing) & TURN_MASK));
                          if (data.pathlength >= MAX_MAP_SIZE*2) return 1;
                      }
                      do {
                          distance =  (min_index & 0x01) ? (map[min_index/2].coordinate.east  - map[destination].coordinate.east) :
                                                           (map[min_index/2].coordinate.north - map[destination].coordinate.north);
                          if (distance < 0) distance = -distance;
                          data.length[data.pathlength++] = (command_forward | distance);
                          if (data.pathlength >= MAX_MAP_SIZE*2) return 1;
                          min_index = map[min_index/2].node_link[2*k + (min_index & 0x01)]*2 + (min_index & 0x01);

